<!DOCTYPE html>
<html lang="ru" >
<head>
  <?php

$count_my_page = "counter.txt";

$hits = file($count_my_page);

$hits[0] ++;

$fp = fopen($count_my_page , "w");

fputs($fp , "$hits[0]");

fclose($fp);

echo $hits[0];

?>
  <meta charset="UTF-8">
  <title>Выставка 100 лет В.П. Астафьеву</title>
  <link rel="stylesheet" href="./style.css">

</head>
<body>
<!-- partial:index.partial.html -->
<div class="center">
<div class="fr-center">

<h1>Виртуальная выставка</h1>
<h2>Посвященная 100 летию</h2><h2> В. П. Астафьева</h2>
</div>
<div class="fr-center">
<img class="first_img" src="astafyev2.jpg" alt="Астафьев" />
</div>
</div>
<div class="fr2-center">
<p>Виктор Петрович Астафьев (1924–2001 гг.) – известный русский писатель, прозаик, эссеист. Лауреат государственных премий СССР и РФ. Его книги пользовались огромной популярностью и издавались миллионными тиражами.</p>
<p>Специалисты абонемента и детского отдела городской библиотеки, подобрали для Вас наиболее читаемые книги.</p>
<p>В книжной подборке ниже, представлены произведения, которые вы найдете в библиотеках городского округа Заречный.</p>
<p>Вы можете выбрать для чтения те произведения, с которыми еще не знакомы, или по новому переосмыслить прочитанные ранее.</p>
</div>

<div class="center">
  
<figure class="snip1527">
  <div class="image"><img src="Tsar_riba.png" alt="pr-sample23" /></div>
  <figcaption>
    <div class="date"><span class="day">1</span><span class="month">Книга</span></div>
    <h3>Царь - рыба</h3>
    <p>

      Повесть про бывалого рыбака Игнатьича, пытавшегося поймать большую, неведомую рыбу. 
    </p>
  </figcaption>
  <a href="#"></a>
</figure>
<figure class="snip1527">
  <div class="image"><img src="Povesti.png" alt="pr-sample24" /></div>
  <figcaption>
    <div class="date"><span class="day">2</span><span class="month">Книга</span></div>
    <h3>Повести и рассказы</h3>
    <p>

      Современная обложка. 2008 год издания.
      Рассказы: "Пастух и пастушка", "Ода русскому огороду", "Ясным ли днем", "Жизнь прожить".
    </p>
  </figcaption>
  <a href="#"></a>
</figure>
<figure class="snip1527">
  <div class="image"><img src="Voyna.png" alt="pr-sample25" /></div>
  <figcaption>
    <div class="date"><span class="day">3</span><span class="month">Книга</span></div>
    <h3>Где-то гремит война</h3>
    <p>

      В этом произведении говорится о простых, но сильных духом людях,

      которые не сломились и помогли друг другу выжить в военное время.
    </p>
  </figcaption>
  <a href="#"></a>
</figure>
</div>
<div class="center">
  <figure class="snip1527">
    <div class="image"><img src="Kon.png" alt="pr-sample23" /></div>
    <figcaption>
      <div class="date"><span class="day">4</span><span class="month">Книга</span></div>
      <h3>Конь с розовой гривой</h3>
      <p>
        «Конь с розовой гривой» – поучительная история Виктора Астафьева. В рассказе повествование идёт от лица взрослого героя. Тот рассказывает об эпизоде, который случился с ним, когда он был маленьким крестьянским мальчишкой. 
      </p>
    </figcaption>
    <a href="#"></a>
  </figure>
  <figure class="snip1527">
    <div class="image"><img src="Pastuh.png" alt="pr-sample24" /></div>
    <figcaption>
      <div class="date"><span class="day">5</span><span class="month">Книга</span></div>
      <h3>Пастух и пастушка</h3>
      <p>
        Произведение посвящено военным действиям. В его основе – любовная история, которая наполнена светлыми чувствами. Любовь и война тесно переплетаются в сюжете, чувства побеждают жизненные сложности, гибель героев.
      </p>
    </figcaption>
    <a href="#"></a>
  </figure>
  <figure class="snip1527">
    <div class="image"><img src="Poklon.png" alt="pr-sample25" /></div>
    <figcaption>
      <div class="date"><span class="day">6</span><span class="month">Книга</span></div>
      <h3>Последний поклон</h3>
      <p>
        Это произведение можно назвать летописью народной жизни с конца 20-х годов двадцатого века и до конца Отечественной войны. Писатель рано остался без матери. Он часто отображал данную тему в произведениях. 
      </p>
    </figcaption>
    <a href="#"></a>
  </figure>
  </div>
  <div class="mob-center">
    <h2>Описание книг</h2>
    <h3>1. Царь - рыба</h3>
    <p>

      Повесть про рыбака Игнатьича, пытавшегося поймать большую, неведомую рыбу.
    </p>
    <h3>2. Повести и рассказы</h3>
    <p>

      Современная обложка. 2008 год издания.
      Рассказы: "Пастух и пастушка", "Ода русскому огороду", "Ясным ли днем", "Жизнь прожить".
    </p>
    <h3>3. Где-то гремит война</h3>
    <p>

      В этом произведении говорится о простых, но сильных духом людях,

      которые не сломились и помогли друг другу выжить в военное время.
    </p>
    <h3>4. Конь с розовой гривой</h3>
      <p>
        «Конь с розовой гривой» – поучительная история Виктора Астафьева. В рассказе повествование идёт от лица взрослого героя. Тот рассказывает об эпизоде, который случился с ним, когда он был маленьким крестьянским мальчишкой. 
      </p>
      <h3>5. Пастух и пастушка</h3>
      <p>
        Произведение посвящено военным действиям. В его основе – любовная история, которая наполнена светлыми чувствами. Любовь и война тесно переплетаются в сюжете, чувства побеждают жизненные сложности, гибель героев
      </p>
      <h3>6. Последний поклон</h3>
      <p>
        Это произведение можно назвать летописью народной жизни с конца 20-х годов двадцатого века и до конца Отечественной войны. Писатель рано остался без матери. Он часто отображал данную тему в произведениях. 
      </p>
  </div>
  <div class="center">
    <h3>МБУ ГО Заречный "ЦБС"</h3>
    <h3>Разработал: библиотекарь Иван Анатольевич</h3>
  </div>
<!-- partial -->
  <script  src="script.js"></script>

</body>
</html>
